package course1.book.course.chapter2;

public class Documentation {
    /**
     * В приведенной главе были изучены переменные,
     * операторы, классы-оболочки
     *
     * А также дескрипторы, которые приведены ниже.
     * @author gambi
     * @version 1.0.0
     * @exception имя класса исключения
     * @param описание параметров к методу
     * @return описание возвр.типа от метода
     * @deprecated указатель устаревшести метода
     * @since определение версии для существования метода
     * @throws исключения, генерируемые методом
     * @see что следует посмотреть дополнительно
     */
}
